/**
 * Εργασία Αντικειμενοστρεφή Προγραμματισμού 2020
 * 3ο Εξάμηνο
 *
 * Σχεδιασμός και υλοποίηση ενός παιχνιδιού ερωτήσεων, βασισμένο στο βραβευμένο παιχνίδι του PlayStation "Buzz! Quiz World".
 *
 * 2ο Μέρος Ανάπτυξης Εργασίας:
 * Το παιχνίδι εκτυλίσσεται σε έναν αριθμό 5 γύρων. Ο κάθε γύρος περιλαμβάνει
 * 5 ερωτήσεις πολλαπλής επιλογής με 4 δυνατές επιλογές, εκ των οποίων μόνο η μία είναι σωστή.
 * Υπάρχουν δύο είδη ερωτήσεων: α) ερωτήσεις που συνοδεύονται και από εικόνα
 * και β) ερωτήσεις που δεν συνοδεύονται από εικόνα. Το παιχνίδι περιλαμβάνει 4 κατηγορίες:
 * αθλητικά, ιστορία, κους-κους και επιστήμη. Το παιχνίδι μπορεί να παίζεται
 * είτε από έναν παίχτη, είτε ανταγωνιστικά από 2 παίχτες. Υπάρχουν διάφοροι τύποι γύρων:
 * Η "Σωστή απάντηση", ο γύρος "Σταμάτησε το χρονόμετρο", το "Ποντάρισμα", η "Γρήγορη απάντηση"
 * καθώς και το "Θερμόμετρο". Το παιχνίδι περιλαμβάνει τυχαιότητα στην σειρά εμφάνισης
 * ερωτήσεων, αλλά και απαντήσεων ανά ερώτηση. Επίσης αποφεύγεται η εμφάνιση της ίδιας
 * ερώτησης στο ίδιο παιχνίδι. Οι γύροι εμφανίζονται και αυτοί με τυχαία σειρά.
 * Οι ερωτήσεις καθώς και τα σχετικά δεδομένα τους (απαντήσεις, σωστή απάντηση, κατηγορία ερώτησης) είναι αποθηκευμένες σε αρχεία κειμένου.
 * Το λογισμικό περιλαμβάνει graphical user interface.
 *
 * @author PANAYIOTIS KYRIACOU
 * @author ALEXANDRA PROUNTZOU
 */

public class Main {


    public static void main(String[] args)  {

        Menu test=new Menu();
        test.createMenuScreen();
        test.start();
    }
}
