/**
 * Εργασία Αντικειμενοστρεφή Προγραμματισμού 2020
 * 3ο Εξάμηνο
 *
 * Σχεδιασμός και υλοποίηση ενός παιχνιδιού ερωτήσεων, βασισμένο στο βραβευμένο παιχνίδι του PlayStation "Buzz! Quiz World".
 *
 * 1ο Μέρος Ανάπτυξης Εργασίας:
 * Περιλαμβάνει μία πρώτη ελάχιστη έκδοση του λογισμικού που σχεδιάζουμε, η οποία αποτελείται από
 * command line interface, αφορά μόνο ατομικό παιχνίδι, περιέχει ερωτήσεις χωρίς εικόνα,
 * μόνο δύο τύπους γύρων (σωστή απάντηση και ποντάρισμα) και δεν θα διατηρεί αρχείο με
 * νίκες και σκορ.
 * Ο αριθμός των ερωτήσεων, καθώς και τα σχετικά δεδομένα τους είναι περιορισμένος.
 * Οι ερωτήσεις είναι αποθηκευμένες σε απλά αρχεία κειμένου .txt, για δική μας ευκολία,
 * και όχι στη μνήμη του υπολογιστή (στον κώδικα του προγράμματος) όπως ζητήθηκε.
 *
 * @author PANAYIOTIS KYRIACOU
 * @author ALEXANDRA PROUNTZOU
 */

public class Main {


    public static void main(String[] args)  {

        PlayersGUI pGui=new PlayersGUI();

        Menu test=new Menu();
        test.createMenuScreen();
        test.start();
    }
}
